{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "return_sequences": true, "trainable": true, "name": "lstm_1", "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "units": 5, "use_bias": true, "implementation": 1, "batch_input_shape": [null, null, 1], "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_constraint": null, "dropout": 0.0, "return_state": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "LSTM", "config": {"go_backwards": false, "return_sequences": false, "trainable": true, "name": "lstm_2", "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "units": 100, "use_bias": true, "implementation": 1, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_state": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "units": 1, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}